In [2]:
import numpy as np 
import pandas as pd

In [4]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3']}

In [6]:
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [8]:
one = pd.DataFrame(data_one)

In [10]:
two = pd.DataFrame(data_two)

In [12]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [14]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [16]:
pd.concat([one,two],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [18]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [20]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [23]:
pd.concat([one,two],axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [25]:
two.columns = one.columns

In [27]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [30]:
mydf = pd.concat([one,two],axis=0)

In [33]:
mydf.index = range(len(mydf))

In [35]:
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

In [37]:
# net asle table download kore practice korte hobe

In [ ]:
pd.merge(registrations,logins,how='inner',on='name')

In [ ]:
pd.merger(left=registrations,right=logins,how='left',one='name')

In [38]:
pd.merger(left=registrations,right=logins,how='right',one='name')

AttributeError: module 'pandas' has no attribute 'merger'

In [ ]:
pd.merge(registrations,logins,how='outer',on='name')

In [ ]:
registrations = registrations.set_index('name')

In [ ]:
pd.merge(registrations,logins,left_index=True,right_on='name',how='inner')

In [ ]:
registrations = registrations.reset_index()

In [ ]:
registrations

In [ ]:
registrations.columns = ['reg_name','reg_id']

In [ ]:
pd.merge(registrations,logins,how='inner',left_on="reg_name",right_on='name')